Repository: AuthFailed/CheckNet
Catalog: App/Resources/Localizable.xcstrings
Source language: ru
Languages: ar, de, en, es, fr, hi, it, ja, ko, pt_br, tr, zh_hans

source: нулевая длина TCP DNS
ar: طول TCP DNS صفري
de: TCP-DNS-Länge null
en: zero-length TCP DNS
es: longitud cero de TCP DNS
fr: longueur TCP DNS nulle
hi: शून्य लंबाई TCP DNS
it: lunghezza zero TCP DNS
ja: TCP DNS の長さがゼロ
ko: TCP DNS 길이가 0
pt_br: comprimento zero de TCP DNS
tr: sıfır uzunlukta TCP DNS
zh_hans: TCP DNS 长度为零

source: О приложении
ar: حول التطبيق
de: Über die App
en: About
es: Acerca de la app
fr: À propos de l'application
hi: ऐप के बारे में
it: Informazioni sull'app
ja: アプリについて
ko: 앱 정보
pt_br: Sobre o app
tr: Uygulama hakkında
zh_hans: 关于应用

source: Об инструменте
ar: حول الأداة
de: Über das Werkzeug
en: About the tool
es: Acerca de la herramienta
fr: À propos de l'outil
hi: उपकरण के बारे में
it: Informazioni sullo strumento
ja: ツールについて
ko: 도구 정보
pt_br: Sobre a ferramenta
tr: Araç hakkında
zh_hans: 关于此工具

source: Оба соединения не прошли — вероятно, IP-блокировка или хост недоступен.
ar: لم ينجح كلا الاتصالين — يُرجَّح حجب IP أو أن المضيف غير متاح.
de: Beide Verbindungen sind nicht durchgekommen – wahrscheinlich eine IP-Sperre oder der Host ist nicht erreichbar.
en: Both connections failed — likely an IP block or the host is unreachable.
es: Ninguna de las dos conexiones pasó: probablemente un bloqueo por IP o el host no está disponible.
fr: Les deux connexions ont échoué — probablement un blocage par IP ou un hôte inaccessible.
hi: दोनों कनेक्शन विफल रहे — संभवतः IP अवरोध है या होस्ट उपलब्ध नहीं है।
it: Entrambe le connessioni sono fallite — probabilmente un blocco IP o l'host non è raggiungibile.
ja: 両方の接続が成立しませんでした — IP ブロックか、ホストに到達できない可能性があります。
ko: 두 연결 모두 통과하지 못했습니다 — IP 차단이거나 호스트에 접속할 수 없을 가능성이 높습니다.
pt_br: Ambas as conexões falharam — provavelmente bloqueio de IP ou o host está inacessível.
tr: Her iki bağlantı da geçmedi — muhtemelen IP engellemesi var ya da sunucu erişilemiyor.
zh_hans: 两个连接均未通过 — 很可能是 IP 封锁，或主机不可访问。

source: Обзор IP
ar: نظرة عامة على IP
de: IP-Übersicht
en: IP overview
es: Resumen de IP
fr: Aperçu de l'IP
hi: IP अवलोकन
it: Panoramica IP
ja: IP の概要
ko: IP 개요
pt_br: Visão geral do IP
tr: IP genel bakış
zh_hans: IP 概览

source: Обзор сети
ar: نظرة عامة على الشبكة
de: Netzwerkübersicht
en: Network overview
es: Vista general de la red
fr: Aperçu du réseau
hi: नेटवर्क अवलोकन
it: Panoramica della rete
ja: ネットワーク概要
ko: 네트워크 개요
pt_br: Visão geral da rede
tr: Ağ genel görünümü
zh_hans: 网络概览

source: Обнаружение
ar: الاكتشاف
de: Erkennung
en: Discovery
es: Detección
fr: Découverte
hi: खोज
it: Rilevamento
ja: 検出
ko: 탐지
pt_br: Descoberta
tr: Keşif
zh_hans: 发现

source: Обновить
ar: تحديث
de: Aktualisieren
en: Refresh
es: Actualizar
fr: Actualiser
hi: रीफ़्रेश करें
it: Aggiorna
ja: 更新
ko: 새로 고침
pt_br: Atualizar
tr: Yenile
zh_hans: 刷新

source: Обновить список серверов
ar: تحديث قائمة الخوادم
de: Serverliste aktualisieren
en: Refresh server list
es: Actualizar la lista de servidores
fr: Actualiser la liste des serveurs
hi: सर्वर सूची अपडेट करें
it: Aggiorna l'elenco dei server
ja: サーバーリストを更新
ko: 서버 목록 새로 고침
pt_br: Atualizar a lista de servidores
tr: Sunucu listesini güncelle
zh_hans: 刷新服务器列表

source: Обновлён
ar: مُحدَّث
de: Aktualisiert
en: Updated
es: Actualizado
fr: Mis à jour
hi: अपडेट किया गया
it: Aggiornato
ja: 更新日
ko: 업데이트됨
pt_br: Atualizado
tr: Güncellendi
zh_hans: 已更新

source: Обойдём диапазон и покажем адреса с TLS 1.3 и их домен из сертификата — кандидаты под dest.
ar: سنمسح النطاق ونعرض العناوين التي تدعم TLS 1.3 ونطاقها من الشهادة — مرشحين لـ dest.
de: Wir durchlaufen den Bereich und zeigen Adressen mit TLS 1.3 und deren Domain aus dem Zertifikat — Kandidaten für dest.
en: We'll sweep the range and show addresses with TLS 1.3 and their certificate domain — candidates for dest.
es: Recorreremos el rango y mostraremos las direcciones con TLS 1.3 y su dominio del certificado: candidatas para dest.
fr: Nous parcourrons la plage et montrerons les adresses en TLS 1.3 avec leur domaine issu du certificat — des candidats pour dest.
hi: हम रेंज को स्कैन करेंगे और TLS 1.3 वाले पते और उनका सर्टिफ़िकेट डोमेन दिखाएंगे — dest के लिए उम्मीदवार।
it: Scansioniamo l'intervallo e mostriamo gli indirizzi con TLS 1.3 e il loro dominio dal certificato: candidati per dest.
ja: 範囲をスキャンし、TLS 1.3 を持つアドレスと証明書のドメインを表示します — dest の候補です。
ko: 대역을 훑어 TLS 1.3을 지원하는 주소와 인증서상의 도메인을 보여줍니다 — dest 후보입니다.
pt_br: Percorremos a faixa e mostramos os endereços com TLS 1.3 e o domínio deles do certificado — candidatos a dest.
tr: Aralığı tarayıp TLS 1.3'e sahip adresleri ve sertifikadaki alan adlarını gösteririz — dest adayları.
zh_hans: 遍历地址段，展示支持 TLS 1.3 的地址及其证书中的域名——作为 dest 候选。

source: Обратный DNS
ar: DNS العكسي
de: Reverse DNS
en: Reverse DNS
es: DNS inverso
fr: DNS inversé
hi: रिवर्स DNS
it: DNS inverso
ja: 逆引き DNS
ko: 역방향 DNS
pt_br: DNS reverso
tr: Ters DNS
zh_hans: 反向 DNS

source: Обратный DNS (rDNS)
ar: DNS العكسي (rDNS)
de: Reverse DNS (rDNS)
en: Reverse DNS (rDNS)
es: DNS inverso (rDNS)
fr: DNS inversé (rDNS)
hi: रिवर्स DNS (rDNS)
it: DNS inverso (rDNS)
ja: 逆引き DNS（rDNS）
ko: 역방향 DNS (rDNS)
pt_br: DNS reverso (rDNS)
tr: Ters DNS (rDNS)
zh_hans: 反向 DNS（rDNS）

source: Обратный DNS по умолчанию
ar: DNS العكسي الافتراضي
de: Reverse DNS standardmäßig
en: Reverse DNS by default
es: DNS inverso por defecto
fr: DNS inversé par défaut
hi: डिफ़ॉल्ट रूप से रिवर्स DNS
it: DNS inverso predefinito
ja: デフォルトの逆引き DNS
ko: 기본 역방향 DNS
pt_br: DNS reverso padrão
tr: Varsayılan ters DNS
zh_hans: 默认反向 DNS

source: обрезанный указатель сжатия DNS
ar: مؤشر ضغط DNS مقتطع
de: abgeschnittener DNS-Kompressionszeiger
en: truncated DNS compression pointer
es: puntero de compresión DNS truncado
fr: pointeur de compression DNS tronqué
hi: कटा हुआ DNS संपीड़न पॉइंटर
it: puntatore di compressione DNS troncato
ja: 切り詰められた DNS 圧縮ポインタ
ko: 잘린 DNS 압축 포인터
pt_br: ponteiro de compressão DNS truncado
tr: kesik DNS sıkıştırma işaretçisi
zh_hans: 被截断的 DNS 压缩指针

source: обрыв
ar: انقطاع
de: Abbruch
en: cut off
es: corte
fr: coupure
hi: रुकावट
it: interruzione
ja: 切断
ko: 끊김
pt_br: interrupção
tr: kopma
zh_hans: 中断

source: Обрыв на 16–20 КБ
ar: انقطاع عند 16–20 كيلوبايت
de: Abbruch bei 16–20 KB
en: Cut off at 16–20 KB
es: Corte a los 16–20 KB
fr: Coupure à 16–20 Ko
hi: 16–20 KB पर कनेक्शन टूटा
it: Interruzione a 16–20 KB
ja: 16〜20 KB で切断
ko: 16~20KB에서 끊김
pt_br: Interrupção em 16–20 KB
tr: 16–20 KB’de kopma
zh_hans: 在 16–20 KB 处中断

source: Обрыв передачи не обнаружен
ar: لم يُكتشف انقطاع في النقل
de: Kein Übertragungsabbruch erkannt
en: No transfer cutoff detected
es: No se ha detectado interrupción de la transferencia
fr: Aucune interruption de transfert détectée
hi: ट्रांसफ़र में रुकावट नहीं मिली
it: Nessuna interruzione del trasferimento rilevata
ja: 転送の中断は検出されず
ko: 전송 중단이 감지되지 않음
pt_br: Nenhuma interrupção da transferência detectada
tr: Aktarım kesintisi saptanmadı
zh_hans: 未发现传输中断

source: Обрывов
ar: عدد الانقطاعات
de: Abbrüche
en: Drops
es: Interrupciones
fr: Interruptions
hi: रुकावटें
it: Interruzioni
ja: 中断回数
ko: 중단 횟수
pt_br: Interrupções
tr: Kesinti sayısı
zh_hans: 中断次数

source: Объединяет трассировку и непрерывный ping: постоянно опрашивает каждый хоп и копит статистику потерь и задержек. Аналог WinMTR — удобно ловить нестабильный участок.
ar: يجمع بين تتبّع المسار وping المستمر: يستعلم عن كل قفزة باستمرار ويجمع إحصاءات الفقد والتأخير. مماثل لـ WinMTR — مفيد لرصد المقطع غير المستقر.
de: Kombiniert Traceroute und fortlaufenden Ping: fragt jeden Hop ständig ab und sammelt Statistiken zu Verlust und Latenz. Ähnlich wie WinMTR – praktisch, um einen instabilen Abschnitt aufzuspüren.
en: Combines traceroute and continuous ping: constantly polls each hop and accumulates loss and latency stats. Like WinMTR — handy for catching an unstable segment.
es: Combina el trazado de ruta con un ping continuo: sondea constantemente cada salto y acumula estadísticas de pérdidas y latencia. Equivalente a WinMTR, práctico para detectar el tramo inestable.
fr: Combine la traçabilité et le ping continu : interroge en permanence chaque saut et accumule des statistiques de pertes et de latences. Équivalent de WinMTR — pratique pour repérer un segment instable.
hi: ट्रेसरूट और निरंतर ping को जोड़ता है: हर हॉप को लगातार जाँचता है और हानि व विलंब के आँकड़े जमा करता है। WinMTR के समान — अस्थिर हिस्से को पकड़ने में सुविधाजनक।
it: Combina il traceroute e il ping continuo: interroga costantemente ogni hop e accumula statistiche di perdita e latenza. Analogo a WinMTR — utile per individuare i tratti instabili.
ja: トレースルートと継続的な ping を組み合わせ、各ホップを常時ポーリングして損失と遅延の統計を蓄積します。WinMTR に相当し、不安定な区間を捉えるのに便利です。
ko: 트레이스와 연속 ping을 결합합니다: 각 홉을 지속적으로 조회하고 손실 및 지연 통계를 누적합니다. WinMTR와 유사 — 불안정한 구간을 찾는 데 편리합니다.
pt_br: Combina traceroute e ping contínuo: consulta constantemente cada salto e acumula estatísticas de perdas e latências. Semelhante ao WinMTR — prático para flagrar o trecho instável.
tr: Traceroute ile sürekli ping'i birleştirir: her sıçramayı sürekli sorgular ve kayıp ile gecikme istatistiklerini biriktirir. WinMTR benzeri — kararsız bir bölümü yakalamak için kullanışlı.
zh_hans: 结合路由追踪与持续 ping：不断探测每一跳并累计丢包与延迟统计。类似 WinMTR — 便于定位不稳定的网段。

source: Объясняем доступ к сети и геопозиции до системного запроса.
ar: نشرح الوصول إلى الشبكة والموقع قبل أن يطلبه النظام.
de: Wir erklären Netzwerk- und Standortzugriff, bevor das System fragt.
en: We explain network and location access before the system asks.
es: Explicamos el acceso a la red y a la ubicación antes de que lo pida el sistema.
fr: Nous expliquons l'accès au réseau et à la localisation avant que le système ne le demande.
hi: सिस्टम पूछने से पहले हम नेटवर्क और स्थान पहुँच समझाते हैं।
it: Spieghiamo l'accesso a rete e posizione prima che lo chieda il sistema.
ja: システムが尋ねる前に、ネットワークと位置情報のアクセスを説明します。
ko: 시스템이 묻기 전에 네트워크와 위치 접근을 설명합니다.
pt_br: Explicamos o acesso à rede e à localização antes de o sistema pedir.
tr: Ağ ve konum erişimini sistem sormadan önce açıklıyoruz.
zh_hans: 在系统询问之前，我们先解释网络与定位权限。

source: обяз.
ar: إلزامي
de: erf.
en: required
es: oblig.
fr: oblig.
hi: आवश्यक
it: obbl.
ja: 必須
ko: 필수
pt_br: obrig.
tr: zorunlu
zh_hans: 必填

source: Ограничение до TLS 1.2 — так выглядят соединения старых клиентов.
ar: التقييد حتى TLS 1.2 — هكذا تبدو اتصالات العملاء القدامى.
de: Begrenzt auf TLS 1.2 – so sehen Verbindungen älterer Clients aus.
en: Capped at TLS 1.2 — this is how connections from older clients look.
es: Limitado a TLS 1.2: así son las conexiones de los clientes antiguos.
fr: Limitation à TLS 1.2 — c’est ainsi que se présentent les connexions des anciens clients.
hi: TLS 1.2 तक की सीमा — पुराने क्लाइंट के कनेक्शन ऐसे दिखते हैं।
it: Limite a TLS 1.2: così appaiono le connessioni dei client meno recenti.
ja: TLS 1.2 までに制限した、古いクライアントと同様の接続です。
ko: TLS 1.2까지로 제한한, 구형 클라이언트와 같은 형태의 연결이에요.
pt_br: Limitado a TLS 1.2: é assim que aparecem as conexões de clientes antigos.
tr: TLS 1.2 ile sınırlama — eski istemcilerin bağlantıları böyle görünür.
zh_hans: 限制为 TLS 1.2，旧版客户端的连接就是这样。

source: Одинарный NAT
ar: NAT مفرد
de: Einfaches NAT
en: Single NAT
es: NAT simple
fr: NAT simple
hi: एकल NAT
it: NAT singolo
ja: 単一 NAT
ko: 단일 NAT
pt_br: NAT simples
tr: Tekli NAT
zh_hans: 单层 NAT

source: Ожидание ответа…
ar: في انتظار الاستجابة…
de: Warten auf Antwort …
en: Waiting for response…
es: Esperando respuesta…
fr: En attente de réponse…
hi: उत्तर की प्रतीक्षा…
it: In attesa di risposta…
ja: 応答を待機中…
ko: 응답 대기 중…
pt_br: Aguardando resposta…
tr: Yanıt bekleniyor…
zh_hans: 等待响应…

source: ожидание проверки
ar: بانتظار الفحص
de: warte auf Prüfung
en: awaiting check
es: esperando comprobación
fr: en attente
hi: जाँच की प्रतीक्षा
it: in attesa di verifica
ja: 確認待ち
ko: 확인 대기
pt_br: aguardando verificação
tr: kontrol bekleniyor
zh_hans: 等待检测

source: ожидание…
ar: في الانتظار…
de: warten …
en: waiting…
es: esperando…
fr: en attente…
hi: प्रतीक्षा…
it: in attesa…
ja: 待機中…
ko: 대기 중…
pt_br: aguardando…
tr: bekleniyor…
zh_hans: 等待中…

source: ок
ar: ناجح
de: ok
en: ok
es: ok
fr: ok
hi: ठीक
it: ok
ja: OK
ko: 정상
pt_br: ok
tr: ok
zh_hans: 正常

source: Ок
ar: حسنًا
de: OK
en: OK
es: OK
fr: OK
hi: ठीक है
it: OK
ja: OK
ko: 확인
pt_br: OK
tr: Tamam
zh_hans: OK

source: Океания
ar: أوقيانوسيا
de: Ozeanien
en: Oceania
es: Oceanía
fr: Océanie
hi: ओशिनिया
it: Oceania
ja: オセアニア
ko: 오세아니아
pt_br: Oceania
tr: Okyanusya
zh_hans: 大洋洲

source: Омск
ar: أومسك
de: Omsk
en: Omsk
es: Omsk
fr: Omsk
hi: ओम्स्क
it: Omsk
ja: オムスク
ko: 옴스크
pt_br: Omsk
tr: Omsk
zh_hans: 鄂木斯克

source: Онлайн
ar: متصل
de: Online
en: Online
es: En línea
fr: En ligne
hi: ऑनलाइन
it: Online
ja: オンライン
ko: 온라인
pt_br: Online
tr: Çevrimiçi
zh_hans: 在线

source: Оператор использует Carrier-Grade NAT — входящие подключения и проброс портов недоступны.
ar: يستخدم المشغّل Carrier-Grade NAT — الاتصالات الواردة وإعادة توجيه المنافذ غير متاحة.
de: Der Anbieter verwendet Carrier-Grade NAT – eingehende Verbindungen und Portweiterleitung sind nicht möglich.
en: The carrier uses Carrier-Grade NAT — incoming connections and port forwarding are unavailable.
es: El operador usa Carrier-Grade NAT: las conexiones entrantes y el reenvío de puertos no están disponibles.
fr: L'opérateur utilise un Carrier-Grade NAT — les connexions entrantes et la redirection de ports sont indisponibles.
hi: ऑपरेटर Carrier-Grade NAT का उपयोग करता है — इनकमिंग कनेक्शन और पोर्ट फ़ॉरवर्डिंग उपलब्ध नहीं हैं।
it: L'operatore usa il Carrier-Grade NAT — le connessioni in entrata e l'inoltro delle porte non sono disponibili.
ja: 通信事業者が Carrier-Grade NAT を使用しています — 着信接続とポート転送は利用できません。
ko: 통신사가 Carrier-Grade NAT를 사용합니다 — 인바운드 연결과 포트 포워딩을 사용할 수 없습니다.
pt_br: A operadora usa Carrier-Grade NAT — conexões de entrada e redirecionamento de portas não estão disponíveis.
tr: Operatör Carrier-Grade NAT kullanıyor — gelen bağlantılar ve port yönlendirme kullanılamaz.
zh_hans: 运营商使用运营商级 NAT — 无法进行入站连接和端口转发。

source: Оповещения мониторинга включены
ar: تنبيهات المراقبة مُفعّلة
de: Überwachungshinweise an
en: Monitoring alerts on
es: Avisos de monitoreo activados
fr: Alertes de surveillance activées
hi: निगरानी अलर्ट चालू
it: Avvisi di monitoraggio attivi
ja: 監視の通知はオン
ko: 모니터링 알림 켜짐
pt_br: Alertas de monitoramento ativados
tr: İzleme uyarıları açık
zh_hans: 监控提醒已开启

source: Оповещения мониторинга заглушены
ar: تنبيهات المراقبة مكتومة
de: Überwachungshinweise stumm
en: Monitoring alerts muted
es: Avisos de monitoreo silenciados
fr: Alertes de surveillance coupées
hi: निगरानी अलर्ट म्यूट
it: Avvisi di monitoraggio silenziati
ja: 監視の通知はミュート
ko: 모니터링 알림 음소거됨
pt_br: Alertas de monitoramento silenciados
tr: İzleme uyarıları susturuldu
zh_hans: 监控提醒已静音

source: Определение сети доступно только на iOS.
ar: تحديد الشبكة متاح على iOS فقط.
de: Die Netzwerkerkennung ist nur unter iOS verfügbar.
en: Network detection is available on iOS only.
es: La detección de la red solo está disponible en iOS.
fr: La détection du réseau n’est disponible que sur iOS.
hi: नेटवर्क की पहचान केवल iOS पर उपलब्ध है।
it: Il rilevamento della rete è disponibile solo su iOS.
ja: ネットワークの判別は iOS でのみ利用できます。
ko: 네트워크 확인은 iOS에서만 사용할 수 있어요.
pt_br: A detecção da rede está disponível apenas no iOS.
tr: Ağ algılama yalnızca iOS’ta kullanılabilir.
zh_hans: 网络识别仅在 iOS 上可用。

source: Определение сети недоступно
ar: تحديد الشبكة غير متاح
de: Netzwerkerkennung nicht verfügbar
en: Network detection unavailable
es: Detección de red no disponible
fr: Détection du réseau indisponible
hi: नेटवर्क की पहचान उपलब्ध नहीं
it: Rilevamento della rete non disponibile
ja: ネットワークを判別できません
ko: 네트워크를 확인할 수 없음
pt_br: Detecção de rede indisponível
tr: Ağ algılama kullanılamıyor
zh_hans: 无法识别网络

source: Определим тип NAT, внешний адрес и наличие CGNAT.
ar: سنحدّد نوع NAT والعنوان الخارجي ووجود CGNAT.
de: Wir bestimmen den NAT-Typ, die externe Adresse und das Vorhandensein von CGNAT.
en: We'll determine NAT type, external address, and whether CGNAT is present.
es: Determinaremos el tipo de NAT, la dirección externa y la presencia de CGNAT.
fr: Déterminons le type de NAT, l'adresse externe et la présence d'un CGNAT.
hi: हम NAT का प्रकार, बाहरी पता और CGNAT की उपस्थिति निर्धारित करेंगे।
it: Determiniamo il tipo di NAT, l'indirizzo esterno e la presenza di CGNAT.
ja: NAT のタイプ、外部アドレス、CGNAT の有無を判定します。
ko: NAT 유형, 외부 주소, CGNAT 여부를 확인합니다.
pt_br: Vamos determinar o tipo de NAT, o endereço externo e a presença de CGNAT.
tr: NAT türünü, dış adresi ve CGNAT varlığını belirleyelim.
zh_hans: 确定 NAT 类型、外网地址以及是否存在 CGNAT。

source: Определить
ar: تحديد
de: Ermitteln
en: Look up
es: Localizar
fr: Localiser
hi: पता लगाएँ
it: Individua
ja: 調べる
ko: 조회
pt_br: Localizar
tr: Bul
zh_hans: 查询

source: Определить MTU
ar: تحديد MTU
de: MTU bestimmen
en: Determine MTU
es: Determinar MTU
fr: Déterminer le MTU
hi: MTU निर्धारित करें
it: Determina l'MTU
ja: MTU を判定
ko: MTU 확인
pt_br: Determinar MTU
tr: MTU belirle
zh_hans: 确定 MTU

source: Определяем сеть…
ar: جارٍ تحديد الشبكة…
de: Netzwerk wird erkannt …
en: Detecting network…
es: Detectando la red…
fr: Détection du réseau…
hi: नेटवर्क पहचाना जा रहा है…
it: Rilevamento della rete…
ja: ネットワークを判別中…
ko: 네트워크 확인 중…
pt_br: Detectando a rede…
tr: Ağ algılanıyor…
zh_hans: 正在识别网络…

source: Определяет предполагаемую страну, город, сеть (ASN и оператора) для IP или домена, и даёт ссылки на bgp.tools, Hurricane Electric и PeeringDB. Запрос уходит к внешнему сервису геолокации.
ar: يقدّر الدولة والمدينة والشبكة (ASN والمشغّل) المحتملة لعنوان IP أو نطاق، مع روابط إلى bgp.tools وHurricane Electric وPeeringDB. يُرسَل الطلب إلى خدمة تحديد موقع خارجية.
de: Schätzt das wahrscheinliche Land, die Stadt und das Netz (ASN und Betreiber) einer IP oder Domain, mit Links zu bgp.tools, Hurricane Electric und PeeringDB. Die Anfrage geht an einen externen Geolokalisierungsdienst.
en: Estimates the likely country, city and network (ASN and operator) for an IP or domain, with links to bgp.tools, Hurricane Electric and PeeringDB. The request goes to an external geolocation service.
es: Estima el país, la ciudad y la red (ASN y operador) probables de una IP o un dominio, con enlaces a bgp.tools, Hurricane Electric y PeeringDB. La consulta va a un servicio externo de geolocalización.
fr: Estime le pays, la ville et le réseau (ASN et opérateur) probables d’une IP ou d’un domaine, avec des liens vers bgp.tools, Hurricane Electric et PeeringDB. La requête est envoyée à un service de géolocalisation externe.
hi: किसी IP या डोमेन के संभावित देश, शहर और नेटवर्क (ASN और ऑपरेटर) का अनुमान लगाता है, और bgp.tools, Hurricane Electric तथा PeeringDB के लिंक देता है। अनुरोध बाहरी भू-स्थान सेवा को जाता है।
it: Stima il probabile paese, città e rete (ASN e operatore) di un IP o dominio, con link a bgp.tools, Hurricane Electric e PeeringDB. La richiesta va a un servizio di geolocalizzazione esterno.
ja: IP またはドメインについて、推定される国・都市・ネットワーク（ASN と事業者）を判定し、bgp.tools、Hurricane Electric、PeeringDB へのリンクを表示します。リクエストは外部の位置情報サービスに送られます。
ko: IP나 도메인의 예상 국가·도시·네트워크(ASN 및 사업자)를 추정하고 bgp.tools, Hurricane Electric, PeeringDB 링크를 제공합니다. 요청은 외부 위치 서비스로 전송됩니다.
pt_br: Estima o provável país, cidade e rede (ASN e operadora) de um IP ou domínio, com links para bgp.tools, Hurricane Electric e PeeringDB. A solicitação vai a um serviço externo de geolocalização.
tr: Bir IP veya alan adı için olası ülke, şehir ve ağı (ASN ve operatör) tahmin eder; bgp.tools, Hurricane Electric ve PeeringDB bağlantıları verir. İstek harici bir konum servisine gider.
zh_hans: 为 IP 或域名推测所在国家/地区、城市和网络（ASN 及运营商），并提供指向 bgp.tools、Hurricane Electric 和 PeeringDB 的链接。请求会发送到外部地理位置服务。

source: Определяет тип NAT и ваш внешний IP через STUN. Помогает понять, находитесь ли вы за CGNAT (общим адресом провайдера).
ar: يحدّد نوع NAT وعنوان IP الخارجي عبر STUN. يساعد على معرفة ما إذا كنت خلف CGNAT (عنوان مشترك للمزوّد).
de: Bestimmt den NAT-Typ und Ihre externe IP über STUN. Hilft zu verstehen, ob Sie sich hinter CGNAT (einer gemeinsamen Anbieteradresse) befinden.
en: Determines NAT type and your external IP via STUN. Helps you tell whether you're behind CGNAT (a shared provider address).
es: Determina el tipo de NAT y tu IP externa mediante STUN. Ayuda a saber si estás detrás de un CGNAT (dirección compartida del proveedor).
fr: Détermine le type de NAT et votre IP externe via STUN. Permet de savoir si vous êtes derrière un CGNAT (adresse partagée du fournisseur).
hi: STUN के माध्यम से NAT का प्रकार और आपका बाहरी IP निर्धारित करता है। यह समझने में मदद करता है कि क्या आप CGNAT (प्रदाता के साझा पते) के पीछे हैं।
it: Determina il tipo di NAT e il tuo IP esterno tramite STUN. Aiuta a capire se ti trovi dietro un CGNAT (indirizzo condiviso del provider).
ja: STUN を通じて NAT のタイプと外部 IP を判定します。CGNAT（プロバイダーの共有アドレス）の背後にいるかどうかを確認するのに役立ちます。
ko: STUN을 통해 NAT 유형과 외부 IP를 확인합니다. CGNAT(제공자 공유 주소) 뒤에 있는지 파악하는 데 유용합니다.
pt_br: Determina o tipo de NAT e seu IP externo via STUN. Ajuda a entender se você está atrás de CGNAT (endereço compartilhado do provedor).
tr: STUN üzerinden NAT türünü ve dış IP'nizi belirler. CGNAT'ın (sağlayıcının ortak adresi) arkasında olup olmadığınızı anlamaya yardımcı olur.
zh_hans: 通过 STUN 确定 NAT 类型和你的外网 IP。帮助判断你是否处于 CGNAT（运营商共享地址）之后。

source: Опросим сразу несколько сервисов геолокации и покажем согласованный результат — страну, город, сеть (ASN и оператора) — плюс ответ каждого сервиса отдельно. Пустое поле — ваш публичный IP.
ar: نستعلم عدة خدمات لتحديد الموقع دفعة واحدة ونعرض نتيجة متوافقة — الدولة والمدينة والشبكة (ASN والمشغّل) — إضافةً إلى رد كل خدمة على حدة. الحقل الفارغ يعني عنوان IP العام الخاص بك.
de: Wir fragen mehrere Geolokalisierungsdienste gleichzeitig ab und zeigen ein übereinstimmendes Ergebnis – Land, Stadt, Netz (ASN und Betreiber) – sowie die Antwort jedes Dienstes einzeln. Leeres Feld = deine öffentliche IP.
en: We query several geolocation services at once and show a consensus result — country, city, network (ASN and operator) — plus each service’s answer separately. Empty field means your public IP.
es: Consultamos varios servicios de geolocalización a la vez y mostramos un resultado consensuado —país, ciudad, red (ASN y operador)— además de la respuesta de cada servicio por separado. El campo vacío es tu IP pública.
fr: Nous interrogeons plusieurs services de géolocalisation à la fois et affichons un résultat consensuel — pays, ville, réseau (ASN et opérateur) — ainsi que la réponse de chaque service séparément. Champ vide = votre IP publique.
hi: हम एक साथ कई भू-स्थान सेवाओं से पूछते हैं और सहमत परिणाम दिखाते हैं — देश, शहर, नेटवर्क (ASN और ऑपरेटर) — साथ ही हर सेवा का उत्तर अलग से। खाली फ़ील्ड यानी आपका सार्वजनिक IP।
it: Interroghiamo più servizi di geolocalizzazione insieme e mostriamo un risultato condiviso — paese, città, rete (ASN e operatore) — più la risposta di ogni servizio separatamente. Campo vuoto = il tuo IP pubblico.
ja: 複数の位置情報サービスに同時に問い合わせ、合意された結果（国・都市・ネットワーク（ASN と事業者））と各サービスの回答を個別に表示します。空欄はあなたの公開 IP です。
ko: 여러 위치 서비스를 동시에 조회해 합의된 결과(국가·도시·네트워크(ASN 및 사업자))와 각 서비스의 응답을 따로 보여줍니다. 빈 칸은 내 공용 IP입니다.
pt_br: Consultamos vários serviços de geolocalização ao mesmo tempo e mostramos um resultado consensual — país, cidade, rede (ASN e operadora) — além da resposta de cada serviço separadamente. Campo vazio é seu IP público.
tr: Aynı anda birkaç konum servisini sorgular ve ortak bir sonuç gösteririz — ülke, şehir, ağ (ASN ve operatör) — ayrıca her servisin yanıtını ayrı ayrı. Boş alan, genel IP’niz demektir.
zh_hans: 我们会同时查询多个地理位置服务，展示一致结果——国家/地区、城市、网络（ASN 及运营商），并单独列出每个服务的应答。留空即你的公网 IP。

source: Организация
ar: المؤسسة
de: Organisation
en: Organization
es: Organización
fr: Organisation
hi: संगठन
it: Organizzazione
ja: 組織
ko: 조직
pt_br: Organização
tr: Kuruluş
zh_hans: 组织

source: Основное
ar: الأساسيات
de: Allgemein
en: General
es: General
fr: Général
hi: मुख्य
it: Generale
ja: 基本
ko: 기본
pt_br: Geral
tr: Genel
zh_hans: 基本
